In [61]:
import pandas as pd
Employee= pd.DataFrame({'cId':[1,2,3,4,5,6],'cName':['Joe','Henry','Sam','Max','dd','aa'],'Salary':[70000,80000,60000,90000,2000,3000],'DepartmentId':[1,2,2,1,1,1]})
Employee= Employee[['cId','cName','Salary','DepartmentId']]
Employee

   cId  cName  Salary  DepartmentId
0    1    Joe   70000             1
1    2  Henry   80000             2
2    3    Sam   60000             2
3    4    Max   90000             1
4    5     dd    2000             1
5    6     aa    3000             1

In [62]:
Department= pd.DataFrame({'Id':[1,2],'Name':['IT','Sales']})
Department= Department[['Id','Name']]
Department

   Id   Name
0   1     IT
1   2  Sales

In [63]:
pme=pd.merge(Department,Employee,how='outer', left_on='Id', right_on='DepartmentId')
pme

   Id   Name  cId  cName  Salary  DepartmentId
0   1     IT    1    Joe   70000             1
1   1     IT    4    Max   90000             1
2   1     IT    5     dd    2000             1
3   1     IT    6     aa    3000             1
4   2  Sales    2  Henry   80000             2
5   2  Sales    3    Sam   60000             2

# way1

In [89]:
#=(oo.assign(rn1=oo.groupby(['month'])['ordernum'].rank(method='dense',ascending=False))
#.query('rn1< 3').sort_values(['month', 'rn1']).astype(int))
pmee=pme.assign(rn1=pme.groupby(['Name'])['Salary'].rank(method='dense',ascending=False)).query('rn1<6').sort_values(['Id','Salary'])
pmee[['Name','cName','rn1']]

    Name  cName  rn1
2     IT     dd  4.0
3     IT     aa  3.0
0     IT    Joe  2.0
1     IT    Max  1.0
5  Sales    Sam  2.0
4  Sales  Henry  1.0

# way2

In [54]:
#oo1['rank']=oo1.groupby(['month'])['ordernum'].rank(method='first',ascending=False).astype(int)
#oo1.sort_values('month') #default is True
                                                     
pme['rank']=pme.groupby(['Name'])['Salary'].rank(method='first',ascending=True).astype(int)

# after groupby, pme changed
print(pme.sort_values(['Id','Salary']))
#aftwe sort_value, pme is not changed.
print(pme.sort_values(['Id','Salary'])[['Name','cName','rank']])
pme1=pme.sort_values(['Id','Salary'])[['Name','cName','rank']]
print(pme1[pme1['rank']<3])

   Id   Name  cId  cName  Salary  DepartmentId  rank
2   1     IT    5     dd    2000             1     1
3   1     IT    6     aa    3000             1     2
0   1     IT    1    Joe   70000             1     3
1   1     IT    4    Max   90000             1     4
5   2  Sales    3    Sam   60000             2     1
4   2  Sales    2  Henry   80000             2     2
    Name  cName  rank
2     IT     dd     1
3     IT     aa     2
0     IT    Joe     3
1     IT    Max     4
5  Sales    Sam     1
4  Sales  Henry     2
    Name  cName  rank
2     IT     dd     1
3     IT     aa     2
5  Sales    Sam     1
4  Sales  Henry     2

In [35]:
print(pme.sort_values(by=['cId']))

   Id   Name  cId  cName  Salary  DepartmentId  rank
0   1     IT    1    Joe   70000             1     3
4   2  Sales    2  Henry   80000             2     2
5   2  Sales    3    Sam   60000             2     1
1   1     IT    4    Max   90000             1     4
2   1     IT    5     dd    2000             1     1
3   1     IT    6     aa    3000             1     2

# SQL WINDOWS FUNCTION

#sql


drop table if exists q184Department;

Create table If Not Exists q184Employee (customerId int, Name varchar(255), Salary int, DepartmentId int);

Create table If Not Exists q184Department (depId int, Name varchar(255));
Truncate table q184Employee;

insert into q184Employee values ('101', 'Joe', '70000', '1');

insert into q184Employee values ('201', 'Jim', '90000', '1');  

insert into q184Employee values ('109', 'Henry', '80000', '2'); 

insert into q184Employee values ('104', 'Sam', '60000', '2');

insert into q184Employee values ('205', 'Max', '90000', '1');

Truncate table q184Department;

insert into q184Department values ('1', 'IT');

insert into q184Department values ('2', 'Sales');


select d.Name, e.Name, rank() over (partition by d.Name, customerId order by Salary desc) as rk

from q184Employee e join q184Department d on e.DepartmentId=d.depId